spec/dummy/app/controllers/admin/users_controller.rb

SELECT "users".* FROM "users" WHERE (full_name LIKE '%Balicka%' OR email LIKE '%Balicka%') LIMIT ? OFFSET ?  [["LIMIT", 16], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users" WHERE (full_name LIKE '%Balicka%' OR email LIKE '%Balicka%')
---
    def index
      resources = ::User.all
      # Apply search if present
      if params[:search].present?
        search_term = "%#{params[:search]}%"
        resources = resources.where('full_name LIKE ? OR email LIKE ?', search_term, search_term)
      end
      # Apply role filter if present
      resources = resources.where(role: params[:role]) if params[:role].present?
      # Apply sorting
      if params[:sort_by].present?
        direction = params[:sort_direction] || 'asc'
        resources = resources.order(params[:sort_by] => direction)
      end
      # Paginate
      resources = resources.paginate(page: params[:page] || 1, per_page: params[:per_page] || 16)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
      @user = ::User.find(params[:id])